powerux-jquery-selectablelist/app/controllers/players_controller.rb

SELECT "players".* FROM "players" WHERE ("players"."id" = 1) LIMIT 1
---
  def show
    @player = Player.find(params[:id])

SELECT "players".* FROM "players" WHERE ("players"."id" = 451) LIMIT 1
---
  def edit
    @player = Player.find(params[:id])

SELECT "players".* FROM "players" WHERE ("players"."id" = 451) LIMIT 1
UPDATE "players" SET "updated_at" = '2010-10-22 21:15:02.591109' WHERE ("players"."id" = 451)
---
  def update
    @player = Player.find(params[:id])

    respond_to do |format|
      if @player.update_attributes(params[:player])