powerux-jquery-selectablelist/app/controllers/teams_controller.rb

    def select
      @teams = Team.all
---
SELECT "teams".* FROM "teams"

  def show
    @team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = 1 LIMIT 1

  def edit
    @team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE ("teams"."id" = 1) LIMIT 1